{
  "home": "Home",
  "about": "About me",
  "services": "Services",
  "projects": "Projects",
  "contact": "Contact",

  "site-web": "websites",
  "games": "games",

  "greeting": "Hello",
  "name": "I am Akshay Nema",
  "role": "Frontend developer",

  "im": "who I am",
  "description": "My name is Akshay Nema and I am a Frontend developer.",
  "my-description": "I am strongly interested in learning new technologies and implementing them in my projects. I'm a self-motivated and hardworking individual who is always ready to learn new things and work in a team.",
  "years": "Age: ",
  "from": "From: ",
  "btn-know-more": "Read more",
  "tools": "Languages & Tools",

  "DSA": "Data Structures & Algorithms",
  "DSA-info": "I specialize in crafting optimized solutions for complex challenges, leveraging my experience with over 400+ DSA questions across multiple platforms.",
  "development": "Web development",
  "development-info": "Creation of well-structured web pages, good responsive design, attractive color palette, with interactions that give the user satisfaction when browsing the website.",
  "backend": "Backend Development",
  "backend-info": "I develop scalable, secure backends, handling databases and APIs to ensure smooth data flow and reliable performance for web applications.",
  "maintenance": "Social Media Management",
  "social-media-info": "As the Social Media Lead for GDG, I strategize and manage online presence, fostering community growth and enhancing outreach.",
  "CleanCode": "Clean Code & Collaboration",
  "cleancode-info": "I focus on writing clean, efficient, and maintainable code while excelling in team collaborations to bring projects to life effectively.",
  "optimization": "Website optimization",
  "website-optimization-info": "Complete optimization of your web page, improving loading speed, using optimized images, a good URL, to give a better experience to users who visit the website.",

  "btn-more-projects": "More projects",

  "contact-info": "Contact me by: ",

  "footer-info": "Page created by Akshay Nema ",

  "about-info-1": "Hello! I am Akshay Nema, a third-year computer science and engineering student. With a good foundation in Data Structures and Algorithms and over 400 questions solved across several platforms, I bring problem-solving abilities to every job I handle.",

  "about-info-2": "As a Front-End Developer, I specialize in developing responsive, dynamic user interfaces with HTML, CSS, JavaScript, and React. I'm now expanding my skill set by learning the MERN stack (MongoDB, Express, React, and Node.js) to improve my full-stack development talents. My front-end experience includes using current tools such as Redux for state management, Tailwind CSS for custom styling, and Bootstrap for responsive design.",

  "about-info-3": "In addition to coding, I take pride in producing clean, efficient, and maintainable code, ensuring that my projects are functional and scalable. I'm constantly willing to cooperate with teams and adapt to new technologies in order to provide unique solutions that suit customer needs. If you're searching for someone who is not only technically proficient but also enthusiastic about creating convincing user-centric solutions, I'd be delighted to connect and cooperate!",

  "Resume": "Resume",

  "services-questions": "Frequent questions",
  "services-questions-1": "How do I stay up to date with web development trends?",
  "services-questions-p1": "I constantly expand my knowledge by learning new technologies and frameworks, participating in tech communities like GDG, attending workshops, and following industry blogs and tutorials.",

  "services-questions-2": "How do I ensure my websites are responsive?",
  "services-questions-p2": "I use responsive design techniques such as CSS media queries, mobile-first design, and frameworks like Tailwind CSS and Bootstrap to ensure that websites work seamlessly across different devices and screen sizes.",

  "services-questions-3": "What makes me stand out as a web developer?",
  "services-questions-p3": "My ability to blend modern front-end technologies with a keen eye for design and user experience. I constantly learn and adapt to new trends, and I am committed to delivering scalable, high-performance solutions tailored to the needs of the user.",

  "services-questions-4": "How do I approach working with a team on web development projects??",
  "services-questions-p4": "Collaboration is key to a successful project. I communicate clearly, share ideas, and use tools like Github. Whether working on a small team or a large project, I focus on keeping everything organized and ensuring everyone is aligned on the project goals.",

  "projects-link": "Link:",
  "projects-tec": "Used technology:",

  "projects-info-1-p1": "Built a responsive Task Management Dashboard using React and Redux for state management.",
  "projects-info-1-p2": "The project includes robust CRUD (Create, Read, Update, Delete) operations for tasks, allowing users to manage their tasks effortlessly. The integration of Redux ensures centralized state handling, enhancing application scalability and maintainability.",

  "projects-info-2-p1": "Built a Text Analyzer with features to format text, including uppercase, lowercase, and clearing text.",
  "projects-info-2-p2": "The tool is enriched with advanced functionalities such as dark/light theme toggles, text-to-speech conversion, copying text, and estimating reading time. ",

  "projects-info-3-p1": "Created a visually captivating Classic Car Project inspired by a retro theme using HTML, CSS, and JavaScript. The project showcases vintage cars with a nostalgic design, featuring vibrant retro color palettes, bold typography, and smooth transitions.",
  "projects-info-3-p2": "The project features smooth animations, and interactive hover effects. JavaScript enhances the experience with dynamic elements such as a carousel for browsing cars and responsive design to ensure compatibility across devices.",

  "projects-info-4-p1": "Developed a polished Business Agency Landing Page using HTML, CSS, and JavaScript.",
  "projects-info-4-p2": "The page is designed with a modern aesthetic, featuring a clean layout and intuitive navigation. Smooth card animations enhance the visual appeal, creating a dynamic browsing experience that captivates users and leaves a professional impression.",

  "projects-info-5-p1": "Built a Password Generator Tool using HTML, CSS, and JavaScript, providing users with secure, randomized passwords effortlessly.",
  "projects-info-5-p2": "The Password Generator Tool includes features for generating passwords with lowercase, uppercase letters, numbers, symbols, and spaces. Additionally, it allows users to exclude duplicate characters, ensuring unique and strong passwords tailored to specific security needs.",

  "projects-info-6-p1": "Developed a Food Menu Website using HTML, CSS, and JavaScript, designed for a seamless user experience. The website showcases an interactive and visually appealing menu, enhancing user engagement through smooth navigation.",
  "projects-info-6-p2": "Fully responsive, the website adapts seamlessly to all screen sizes, ensuring smooth functionality across devices. CSS animations and JavaScript interactivity contribute to a fluid and engaging browsing experience for users.",

  "projects-info-7-p1": "Developed a PayPal Clone website using HTML, CSS, and JavaScript, featuring login and signup pages. The design is sleek and functional, mimicking PayPal’s interface with responsive layouts and smooth animations for an engaging user experience.",
  "projects-info-7-p2": "The website adjusts seamlessly to all screen sizes, ensuring compatibility across devices. JavaScript enhances interactivity, while CSS animations provide smooth transitions, creating a polished, user-friendly experience."
}
